[Survived] BlockStatement
src/modules/Admin/AdminApp.tsx:12:49
 interface AdminAppProps {
   status: CheckState;
 }
-const mapStateToProps = (state: reducerType) => {
-  const { status } = state.auth;
-  return {
-    status,
-  };
-};
+const mapStateToProps = (state: reducerType) => {};
 export class AdminApp extends Component<AdminAppProps> {
   render() {

[Survived] BlockStatement
src/modules/Admin/AdminApp.tsx:19:12
   };
 };
 export class AdminApp extends Component<AdminAppProps> {
-  render() {
-    if (this.props.status === CheckState.initiated) {
-      return <Redirect to="/auth" />;
-    }
-    return (
-      <ErrorBoundary>
-        <AdminAppPresenter />
-      </ErrorBoundary>
-    );
-  }
+  render() {}
 }
 

[Survived] EqualityOperator
src/modules/Admin/AdminApp.tsx:20:9
 };
 export class AdminApp extends Component<AdminAppProps> {
   render() {
-    if (this.props.status === CheckState.initiated) {
+    if (this.props.status !== CheckState.initiated) {
       return <Redirect to="/auth" />;
     }

[Survived] ConditionalExpression
src/modules/Admin/AdminApp.tsx:20:9
 };
 export class AdminApp extends Component<AdminAppProps> {
   render() {
-    if (this.props.status === CheckState.initiated) {
+    if (true) {
       return <Redirect to="/auth" />;
     }
