[Survived] BlockStatement
React/hw14/src/App.tsx:4:23
 import React, { FC } from "react";
 import { RouteApp } from "./RouteApp";
 
-const App: FC = () => {
-  return <RouteApp />;
-};
+const App: FC = () => {};
 
 export default App;
