[Survived] ObjectLiteral
src/components/Elements/elements.stories.tsx:5:16
 import { Input, Textarea, Button, Name, Label } from "./elements";
 import { withKnobs, text } from "@storybook/addon-knobs";
 
-export default {
-  title: "Elements",
-  decorators: [withKnobs],
-};
+export default {};
 
 export const elements = () => {

[Survived] StringLiteral
src/components/Elements/elements.stories.tsx:6:10
 import { withKnobs, text } from "@storybook/addon-knobs";
 
 export default {
-  title: "Elements",
+  title: "",
   decorators: [withKnobs],
 };

[Survived] BlockStatement
src/components/Elements/elements.stories.tsx:10:31
   decorators: [withKnobs],
 };
 
-export const elements = () => {
-  const str = text("user", "text");
-  return (
-    <>
-      <div>Input</div>
-      <Input value={str} />
-      <div>Textarea</div>
-      <Textarea>{str}</Textarea>
-      <div>Button</div>
-      <Button>{str}</Button>
-      <div>Name</div>
-      <Name>{str}</Name>
-      <div>Label</div>
-      <Label>{str}</Label>
-    </>
-  );
-};
+export const elements = () => {};
 

[Survived] StringLiteral
src/components/Elements/elements.stories.tsx:11:28
 };
 
 export const elements = () => {
-  const str = text("user", "text");
+  const str = text("user", "");
   return (
     <>
