[Survived] BlockStatement
src/modules/Admin/AdminAppPresenter.tsx:8:44
 import { MainPage } from "@components/Elements/elements";
 import List from "./Grammar/List/List";
 
-export const AdminAppPresenter: FC = () => {
-  return (
-    <>
-      <Header />
-      <MainPage>
-        <BrowserRouter>
-          <LeftMenuPresenter />
-          <Switch>
-            <Route exact path="/admin/grammar" component={List} />
-            <Route exact path="/admin/orphography">
-              OrphographyList
-            </Route>
-          </Switch>
-        </BrowserRouter>
-      </MainPage>
-    </>
-  );
-};
+export const AdminAppPresenter: FC = () => {};
 export default AdminAppPresenter;
 
