[Survived] StringLiteral
src/components/Elements/elements.tsx:6:34
 import { CheckState } from "@auth/types";
 import { Loading } from "@admin/Grammar/List/types";
 
-export const Input = styled.input`
-  padding: 12px 20px;
-  font-size: 16px;
-  border: 1px solid grey;
-  border-radius: 5px;
-  font-weight: 900;
-`;
+export const Input = styled.input``;
 
 export const Textarea = styled.textarea`

[Survived] StringLiteral
src/components/Elements/elements.tsx:14:40
   font-weight: 900;
 `;
 
-export const Textarea = styled.textarea`
-  padding: 12px 20px;
-  font-size: 16px;
-  border: 1px solid grey;
-  border-radius: 5px;
-  font-weight: 900;
-`;
+export const Textarea = styled.textarea``;
 
 export const Button = styled.button`

[Survived] BlockStatement
src/components/Elements/elements.tsx:36:40
     transition: 0.5s;
     background: #1be61b;
   }
-  ${(props: { status: CheckState }) => {
-    if (props.status === CheckState.loading) {
-      return "background: #eeeeee !important; color: #dddddd !important;";
-    }
-  }};
+  ${(props: { status: CheckState }) => {}};
 `;
 

[Survived] ConditionalExpression
src/components/Elements/elements.tsx:37:9
     background: #1be61b;
   }
   ${(props: { status: CheckState }) => {
-    if (props.status === CheckState.loading) {
+    if (false) {
       return "background: #eeeeee !important; color: #dddddd !important;";
     }

[Survived] BlockStatement
src/components/Elements/elements.tsx:37:46
     background: #1be61b;
   }
   ${(props: { status: CheckState }) => {
-    if (props.status === CheckState.loading) {
-      return "background: #eeeeee !important; color: #dddddd !important;";
-    }
+    if (props.status === CheckState.loading) {}
   }};
 `;

[Survived] StringLiteral
src/components/Elements/elements.tsx:55:28
   margin: 5px 0;
 `;
 
-export const Ul = styled.ul`
-  list-style: none;
-`;
+export const Ul = styled.ul``;
 export const Page = styled.div`
   padding: 10px;

[Survived] BlockStatement
src/components/Elements/elements.tsx:70:38
       background: #eeeeee;
     }
   }
-  ${(props: { loading: Loading }) => {
-    if (props.loading === Loading.start) {
-      return "animation: uploading 1s infinite !important;";
-    }
-  }}
+  ${(props: { loading: Loading }) => {}}
 `;
 

[Survived] ConditionalExpression
src/components/Elements/elements.tsx:71:9
     }
   }
   ${(props: { loading: Loading }) => {
-    if (props.loading === Loading.start) {
+    if (false) {
       return "animation: uploading 1s infinite !important;";
     }

[Survived] EqualityOperator
src/components/Elements/elements.tsx:71:9
     }
   }
   ${(props: { loading: Loading }) => {
-    if (props.loading === Loading.start) {
+    if (props.loading !== Loading.start) {
       return "animation: uploading 1s infinite !important;";
     }

[Survived] StringLiteral
src/components/Elements/elements.tsx:77:31
   }}
 `;
 
-export const Menu = styled.div`
-  width: 300px;
-  background: #eee;
-`;
+export const Menu = styled.div``;
 
 export const MainPage = styled.div`

[Survived] StringLiteral
src/components/Elements/elements.tsx:85:37
 export const MainPage = styled.div`
   display: flex;
 `;
-export const ListLink = styled(Link)`
-  color: black;
-  text-decoration: none;
-`;
+export const ListLink = styled(Link)``;
 
