[Survived] BlockStatement
Admin/Grammar/List/List.tsx:14:49
   loading: Loading;
 }
 
-const mapStateToProps = (state: reducerType) => {
-  const { list, loading } = state.grammarList;
-  return {
-    list,
-    loading,
-  };
-};
+const mapStateToProps = (state: reducerType) => {};
 
 const mapDispatchToProps = {

[Survived] BlockStatement
Admin/Grammar/List/List.tsx:27:29
 };
 
 export class List extends Component<GrammarListProps> {
-  async componentDidMount() {
-    await this.props.setList();
-  }
+  async componentDidMount() {}
   render() {
     return <Presenter list={this.props.list} loading={this.props.loading} />;

[Survived] BlockStatement
Admin/Grammar/List/List.tsx:30:12
   async componentDidMount() {
     await this.props.setList();
   }
-  render() {
-    return <Presenter list={this.props.list} loading={this.props.loading} />;
-  }
+  render() {}
 }
 
