[Survived] BlockStatement
Admin/Grammar/List/Presenter.tsx:10:56
   loading: Loading;
 }
 
-const Presenter: FC<ListProps> = (props: ListProps) => {
-  return (
-    <Page loading={props.loading}>
-      <Ul>
-        {props.list.map((item) => (
-          <li key={item.id.toString()}>{item.name}</li>
-        ))}
-      </Ul>
-    </Page>
-  );
-};
+const Presenter: FC<ListProps> = (props: ListProps) => {};
 
 export default Presenter;

[Survived] ArrowFunction
Admin/Grammar/List/Presenter.tsx:14:25
   return (
     <Page loading={props.loading}>
       <Ul>
-        {props.list.map((item) => (
-          <li key={item.id.toString()}>{item.name}</li>
-        ))}
+        {props.list.map(() => undefined)}
       </Ul>
     </Page>
