[Survived] BlockStatement
React/hw14/src/RouteApp.tsx:6:35
 import AuthPage from "@auth/AuthPage";
 import AdminApp from "@admin/AdminApp";
 
-export const RouteApp: FC = () => {
-  return (
-    <BrowserRouter>
-      <Switch>
-        <Route exact path="/">
-          Index
-          <hr />
-          <Link to="/auth">Админка</Link>
-        </Route>
-        <Route exact path="/auth" component={AuthPage} />
-        <Route exact path="/admin" component={AdminApp} />
-      </Switch>
-    </BrowserRouter>
-  );
-};
+export const RouteApp: FC = () => {};
 
 export default RouteApp;
