[Survived] BooleanLiteral
hw14/src/components/ErrorBoundary.tsx:12:23
 }
 
 export class ErrorBoundary extends Component<Props, State> {
-  state = { hasError: false };
+  state = { hasError: true };
 
   static getDerivedStateFromError() {

[Survived] ObjectLiteral
hw14/src/components/ErrorBoundary.tsx:12:11
 }
 
 export class ErrorBoundary extends Component<Props, State> {
-  state = { hasError: false };
+  state = {};
 
   static getDerivedStateFromError() {

[Survived] BlockStatement
hw14/src/components/ErrorBoundary.tsx:14:37
 export class ErrorBoundary extends Component<Props, State> {
   state = { hasError: false };
 
-  static getDerivedStateFromError() {
-    return { hasError: true };
-  }
+  static getDerivedStateFromError() {}
 
   render() {

[Survived] BooleanLiteral
hw14/src/components/ErrorBoundary.tsx:15:24
   state = { hasError: false };
 
   static getDerivedStateFromError() {
-    return { hasError: true };
+    return { hasError: false };
   }
 

[Survived] ObjectLiteral
hw14/src/components/ErrorBoundary.tsx:15:12
   state = { hasError: false };
 
   static getDerivedStateFromError() {
-    return { hasError: true };
+    return {};
   }
 

[Survived] BlockStatement
hw14/src/components/ErrorBoundary.tsx:18:12
     return { hasError: true };
   }
 
-  render() {
-    if (this.state.hasError) {
-      return <h1>Something went wrong.</h1>;
-    }
-    return this.props.children;
-  }
+  render() {}
 }
 

[Survived] BlockStatement
hw14/src/components/ErrorBoundary.tsx:19:30
   }
 
   render() {
-    if (this.state.hasError) {
-      return <h1>Something went wrong.</h1>;
-    }
+    if (this.state.hasError) {}
     return this.props.children;
   }
