[Survived] ArrowFunction
Admin/Grammar/List/modules.tsx:6:37
 import { reducer } from "./reducer";
 import { grammarListSaga } from "./saga";
 
-export const getGrammarListModule = (): ISagaModule<typeof reducer> => ({
-  id: "grammarList",
-  reducerMap: {
-    login: reducer,
-  },
-  sagas: [grammarListSaga],
-});
+export const getGrammarListModule = () => undefined;
 

[Survived] ObjectLiteral
Admin/Grammar/List/modules.tsx:6:73
 import { reducer } from "./reducer";
 import { grammarListSaga } from "./saga";
 
-export const getGrammarListModule = (): ISagaModule<typeof reducer> => ({
-  id: "grammarList",
-  reducerMap: {
-    login: reducer,
-  },
-  sagas: [grammarListSaga],
-});
+export const getGrammarListModule = (): ISagaModule<typeof reducer> => ({});
 
