[Killed] ArrayDeclaration
Admin/Grammar/List/reducer.tsx:5:9
 import { GrammarListType, GrammarList, Loading } from "./types";
 
 export const defaultState: GrammarListType = {
-  list: [],
+  list: ["Stryker was here"],
   loading: Loading.ok,
 };

[Survived] StringLiteral
Admin/Grammar/List/reducer.tsx:8:37
   list: [],
   loading: Loading.ok,
 };
-export const setList = createAction("setList");
+export const setList = createAction("");
 export const grammarListSlice = createSlice({
   name: "grammarList",

[Killed] ObjectLiteral
Admin/Grammar/List/reducer.tsx:12:13
 export const grammarListSlice = createSlice({
   name: "grammarList",
   initialState: defaultState,
-  reducers: {
-    fetch: (state, { payload }: PayloadAction<GrammarList>) => {
-      return { ...state, list: payload };
-    },
-    setLoading: (state, { payload }: PayloadAction<Loading>) => {
-      return { ...state, loading: payload };
-    },
-  },
+  reducers: {},
 });
 export const { actions, reducer } = grammarListSlice;

[Killed] BlockStatement
Admin/Grammar/List/reducer.tsx:13:64
   name: "grammarList",
   initialState: defaultState,
   reducers: {
-    fetch: (state, { payload }: PayloadAction<GrammarList>) => {
-      return { ...state, list: payload };
-    },
+    fetch: (state, { payload }: PayloadAction<GrammarList>) => {},
     setLoading: (state, { payload }: PayloadAction<Loading>) => {
       return { ...state, loading: payload };

[Killed] BlockStatement
Admin/Grammar/List/reducer.tsx:16:65
     fetch: (state, { payload }: PayloadAction<GrammarList>) => {
       return { ...state, list: payload };
     },
-    setLoading: (state, { payload }: PayloadAction<Loading>) => {
-      return { ...state, loading: payload };
-    },
+    setLoading: (state, { payload }: PayloadAction<Loading>) => {},
   },
 });
