[Survived] ObjectLiteral
React/hw14/src/index.tsx:15:37
 
 const sagaMiddleware = createSagaMiddleware();
 
-export const store = configureStore({
-  reducer,
-  middleware: [sagaMiddleware],
-});
+export const store = configureStore({});
 
 function* rootSaga() {

[Survived] ArrayDeclaration
React/hw14/src/index.tsx:17:15
 
 export const store = configureStore({
   reducer,
-  middleware: [sagaMiddleware],
+  middleware: [],
 });
 

[Survived] BlockStatement
React/hw14/src/index.tsx:20:22
   middleware: [sagaMiddleware],
 });
 
-function* rootSaga() {
-  yield fork(loginSaga);
-  yield fork(grammarListSaga);
-}
+function* rootSaga() {}
 
 sagaMiddleware.run(rootSaga);

[Survived] StringLiteral
React/hw14/src/index.tsx:33:27
       <App />
     </React.StrictMode>
   </Provider>,
-  document.getElementById("root")
+  document.getElementById("")
 );
 
