[Killed] BlockStatement
Admin/Grammar/List/saga.tsx:7:34
 import { actions, setList } from "./reducer";
 import { Loading } from "./types";
 
-export function* setGramarList() {
-  try {
-    yield put(actions.setLoading(Loading.start));
-    const gl = yield call(grammarList);
-    yield put(actions.fetch(gl));
-  } finally {
-    yield put(actions.setLoading(Loading.ok));
-  }
-}
+export function* setGramarList() {}
 
 export function* grammarListSaga() {

[Killed] BlockStatement
Admin/Grammar/List/saga.tsx:8:7
 import { Loading } from "./types";
 
 export function* setGramarList() {
-  try {
-    yield put(actions.setLoading(Loading.start));
-    const gl = yield call(grammarList);
-    yield put(actions.fetch(gl));
-  } finally {
+  try {} finally {
     yield put(actions.setLoading(Loading.ok));
   }

[Killed] BlockStatement
Admin/Grammar/List/saga.tsx:12:13
     yield put(actions.setLoading(Loading.start));
     const gl = yield call(grammarList);
     yield put(actions.fetch(gl));
-  } finally {
-    yield put(actions.setLoading(Loading.ok));
-  }
+  } finally {}
 }
 

[Survived] BlockStatement
Admin/Grammar/List/saga.tsx:17:36
   }
 }
 
-export function* grammarListSaga() {
-  yield takeEvery(setList, setGramarList);
-}
+export function* grammarListSaga() {}
 
