[Survived] ArrowFunction
React/hw14/src/functions.tsx:1:49
-export const sleep = (x: number) => new Promise((r) => setTimeout(r, x));
+export const sleep = (x: number) => new Promise(() => undefined);
 

[Survived] ArrowFunction
React/hw14/src/functions.tsx:1:22
-export const sleep = (x: number) => new Promise((r) => setTimeout(r, x));
+export const sleep = () => undefined;
 
