[Survived] ObjectLiteral
hw14/src/pages/Header.tsx:1:21
-const headerStyle = {
-  display: "flex",
-  padding: "10px",
-  borderBottom: "1px solid #aaa",
-};
+const headerStyle = {};
 
 const Header = () => (

[Survived] StringLiteral
hw14/src/pages/Header.tsx:2:12
 const headerStyle = {
-  display: "flex",
+  display: "",
   padding: "10px",
   borderBottom: "1px solid #aaa",

[Survived] StringLiteral
hw14/src/pages/Header.tsx:4:17
 const headerStyle = {
   display: "flex",
   padding: "10px",
-  borderBottom: "1px solid #aaa",
+  borderBottom: "",
 };
 

[Survived] ArrowFunction
hw14/src/pages/Header.tsx:7:16
   borderBottom: "1px solid #aaa",
 };
 
-const Header = () => (
-  <div className="Header" style={headerStyle}>
-    HEADER
-  </div>
-);
+const Header = () => undefined;
 
 export default Header;
