[Survived] ObjectLiteral
modules/Admin/Grammar/data.tsx:7:3
 import { sleep } from "@/functions";
 
 const data: Array<grammar> = [
-  {
-    id: 1,
-    name: "Страница 1",
-    text: "Контент 1",
-  },
+  {},
   {
     id: random.number() + 2,

[Survived] StringLiteral
modules/Admin/Grammar/data.tsx:9:11
 const data: Array<grammar> = [
   {
     id: 1,
-    name: "Страница 1",
+    name: "",
     text: "Контент 1",
   },

[Survived] ArithmeticOperator
modules/Admin/Grammar/data.tsx:13:9
     text: "Контент 1",
   },
   {
-    id: random.number() + 2,
+    id: random.number() - 2,
     name: name.title(),
     text: lorem.sentence(),

[Survived] BlockStatement
modules/Admin/Grammar/data.tsx:19:37
   },
 ];
 
-export async function grammarList() {
-  await sleep(1000);
-  return R.project(["id", "name"], data);
-}
+export async function grammarList() {}
 
 export const grammarDetail = async (id: number) => {

[Survived] BlockStatement
modules/Admin/Grammar/data.tsx:24:52
   return R.project(["id", "name"], data);
 }
 
-export const grammarDetail = async (id: number) => {
-  await sleep(1000);
-  return data.find((item) => item.id == id);
-};
+export const grammarDetail = async (id: number) => {};
 
 export async function updateDetail(id: number, updateData: grammar) {

[Survived] ConditionalExpression
modules/Admin/Grammar/data.tsx:26:30
 
 export const grammarDetail = async (id: number) => {
   await sleep(1000);
-  return data.find((item) => item.id == id);
+  return data.find((item) => true);
 };
 

[Survived] ArrowFunction
modules/Admin/Grammar/data.tsx:26:20
 
 export const grammarDetail = async (id: number) => {
   await sleep(1000);
-  return data.find((item) => item.id == id);
+  return data.find(() => undefined);
 };
 

[Survived] BlockStatement
modules/Admin/Grammar/data.tsx:29:69
   return data.find((item) => item.id == id);
 };
 
-export async function updateDetail(id: number, updateData: grammar) {
-  await sleep(1000);
-  const update: grammar | undefined = data.find((item) => item.id == id);
-  if (!update) return false;
-  update.name = updateData.name;
-  update.text = updateData.text;
-  return true;
-}
+export async function updateDetail(id: number, updateData: grammar) {}
 

[Survived] ConditionalExpression
modules/Admin/Grammar/data.tsx:31:59
 
 export async function updateDetail(id: number, updateData: grammar) {
   await sleep(1000);
-  const update: grammar | undefined = data.find((item) => item.id == id);
+  const update: grammar | undefined = data.find((item) => true);
   if (!update) return false;
   update.name = updateData.name;

[Survived] EqualityOperator
modules/Admin/Grammar/data.tsx:31:59
 
 export async function updateDetail(id: number, updateData: grammar) {
   await sleep(1000);
-  const update: grammar | undefined = data.find((item) => item.id == id);
+  const update: grammar | undefined = data.find((item) => item.id != id);
   if (!update) return false;
   update.name = updateData.name;

[Survived] BooleanLiteral
modules/Admin/Grammar/data.tsx:32:23
 export async function updateDetail(id: number, updateData: grammar) {
   await sleep(1000);
   const update: grammar | undefined = data.find((item) => item.id == id);
-  if (!update) return false;
+  if (!update) return true;
   update.name = updateData.name;
   update.text = updateData.text;

[Survived] ConditionalExpression
modules/Admin/Grammar/data.tsx:32:7
 export async function updateDetail(id: number, updateData: grammar) {
   await sleep(1000);
   const update: grammar | undefined = data.find((item) => item.id == id);
-  if (!update) return false;
+  if (false) return false;
   update.name = updateData.name;
   update.text = updateData.text;

[Survived] BooleanLiteral
modules/Admin/Grammar/data.tsx:35:10
   if (!update) return false;
   update.name = updateData.name;
   update.text = updateData.text;
-  return true;
+  return false;
 }
 
