[Survived] ObjectLiteral
hw14/src/pages/Layout.tsx:7:14
 const leftMenuStyle = {
   width: "300px",
 };
-const page = {
-  display: "flex",
-};
+const page = {};
 const pageStyle = {
   padding: "0 20px",

[Survived] ArrowFunction
hw14/src/pages/Layout.tsx:14:16
   padding: "0 20px",
 };
 
-const Layout = (props) => (
-  <div>
-    <Header />
-    <div style={page}>
-      <div style={leftMenuStyle}>
-        <NavBar />
-      </div>
-      <div style={pageStyle}>{props.children}</div>
-    </div>
-  </div>
-);
+const Layout = () => undefined;
 
 export default Layout;
