[Survived] BlockStatement
modules/Admin/Header/Header.tsx:11:57
   logout: () => void;
 }
 
-const Header: FC<HeaderProps> = (props: HeaderProps) => {
-  return <HeaderPresenter logout={props.logout} />;
-};
+const Header: FC<HeaderProps> = (props: HeaderProps) => {};
 
 const mapDispatchToProps = (dispatch) => {

[Survived] BlockStatement
modules/Admin/Header/Header.tsx:15:42
   return <HeaderPresenter logout={props.logout} />;
 };
 
-const mapDispatchToProps = (dispatch) => {
-  return {
-    logout: bindActionCreators(actions.logout, dispatch),
-  };
-};
+const mapDispatchToProps = (dispatch) => {};
 
 export default connect(undefined, mapDispatchToProps)(Header);
