[Survived] ObjectLiteral
hw14/src/pages/NavBar.tsx:2:19
 import Link from "next/link";
-const menuStyle = {
-  background: "#eeeeee",
-  padding: "10px",
-};
+const menuStyle = {};
 const NavBar = () => (
   <div style={menuStyle}>

[Survived] StringLiteral
hw14/src/pages/NavBar.tsx:3:15
 import Link from "next/link";
 const menuStyle = {
-  background: "#eeeeee",
+  background: "",
   padding: "10px",
 };

[Survived] ArrowFunction
hw14/src/pages/NavBar.tsx:6:16
   background: "#eeeeee",
   padding: "10px",
 };
-const NavBar = () => (
-  <div style={menuStyle}>
-    <ul>
-      <li>
-        <Link href="/grammar">
-          <a>Грамматика</a>
-        </Link>
-      </li>
-      <li>
-        <Link href="/orphography">
-          <a>Орфография</a>
-        </Link>
-      </li>
-    </ul>
-  </div>
-);
+const NavBar = () => undefined;
 
 export default NavBar;
