[Survived] ObjectLiteral
modules/Admin/Header/HeaderPresenter.stories.tsx:5:16
 import HeaderPresenter from "./HeaderPresenter";
 import { action } from "@storybook/addon-actions";
 
-export default {
-  title: "Admin",
-};
+export default {};
 export const Header: React.FC<{}> = () => {
   return <HeaderPresenter logout={action("logout")} />;

[Survived] BlockStatement
modules/Admin/Header/HeaderPresenter.stories.tsx:8:43
 export default {
   title: "Admin",
 };
-export const Header: React.FC<{}> = () => {
-  return <HeaderPresenter logout={action("logout")} />;
-};
+export const Header: React.FC<{}> = () => {};
 
