[Survived] BlockStatement
modules/Admin/Header/HeaderPresenter.tsx:7:73
   logout: () => void;
 }
 
-export const HeaderPresenter: FC<HeaderProps> = (props: HeaderProps) => {
-  return (
-    <>
-      <button onClick={props.logout}> Выйти</button>
-      <hr />
-    </>
-  );
-};
+export const HeaderPresenter: FC<HeaderProps> = (props: HeaderProps) => {};
 export default HeaderPresenter;
 
