[Survived] BlockStatement
src/pages/grammar/index.tsx:7:39
 import { initializeStore } from "@store/store";
 import { grammarList } from "@grammar/data";
 
-export default  function grammar(data){
-  const { list } = data.initialReduxState;
-  return <Layout>
-    <h3>Грамматика</h3>
-    <hr/>
-    <div>
-      <ul>
-        {
-          list.map((item:GrammarList)=>{
-            return <li key={item.id.toString()}>{item.name}</li>;
-          })
-        }
-      </ul>
-    </div>
-  </Layout>;
-}
+export default  function grammar(data){}
 
 export async function getServerSideProps() {

[Survived] BlockStatement
src/pages/grammar/index.tsx:15:40
     <div>
       <ul>
         {
-          list.map((item:GrammarList)=>{
-            return <li key={item.id.toString()}>{item.name}</li>;
-          })
+          list.map((item:GrammarList)=>{})
         }
       </ul>

[Survived] BlockStatement
src/pages/grammar/index.tsx:24:44
   </Layout>;
 }
 
-export async function getServerSideProps() {
-  const reduxStore = initializeStore();
-  const { dispatch } = reduxStore;
-  const gl = await grammarList();
-  await dispatch({
-    type: "grammarList/fetch",
-    payload: gl
-  });
-  return { props: { initialReduxState: reduxStore.getState() } }
-}
+export async function getServerSideProps() {}

[Survived] StringLiteral
src/pages/grammar/index.tsx:29:11
   const { dispatch } = reduxStore;
   const gl = await grammarList();
   await dispatch({
-    type: "grammarList/fetch",
+    type: "",
     payload: gl
   });
