[Survived] BlockStatement
modules/Admin/LeftMenu/LeftMenuPresenter.stories.tsx:7:42
 export default {
   title: "Admin",
 };
-export const LeftMenu1: React.FC = () => {
-  return (
-    <BrowserRouter>
-      <LeftMenu />
-    </BrowserRouter>
-  );
-};
+export const LeftMenu1: React.FC = () => {};
 
