[Survived] ObjectLiteral
src/pages/grammar/reducer.tsx:4:46
 import { createSlice, PayloadAction } from "@reduxjs/toolkit";
 import { GrammarListType, GrammarList } from "./types";
 
-export const defaultState: GrammarListType = {
-  list: [],
-  loading: false,
-};
+export const defaultState: GrammarListType = {};
 export const grammarListSlice = createSlice({
   name: "grammarList",

[Survived] BooleanLiteral
src/pages/grammar/reducer.tsx:6:12
 
 export const defaultState: GrammarListType = {
   list: [],
-  loading: false,
+  loading: true,
 };
 export const grammarListSlice = createSlice({

[Survived] ObjectLiteral
src/pages/grammar/reducer.tsx:8:45
   list: [],
   loading: false,
 };
-export const grammarListSlice = createSlice({
-  name: "grammarList",
-  initialState: defaultState,
-  reducers: {
-    setList: (state) => state,
-    fetch: (state, { payload }: PayloadAction<GrammarList>) => {
-      return { ...state, list: payload };
-    },
-    setLoading: (state, { payload }: PayloadAction<boolean>) => {
-      return { ...state, loading: payload };
-    },
-  },
-});
+export const grammarListSlice = createSlice({});
 export const { actions, reducer } = grammarListSlice;
 

[Survived] ArrowFunction
src/pages/grammar/reducer.tsx:12:14
   name: "grammarList",
   initialState: defaultState,
   reducers: {
-    setList: (state) => state,
+    setList: () => undefined,
     fetch: (state, { payload }: PayloadAction<GrammarList>) => {
       return { ...state, list: payload };

[Survived] BlockStatement
src/pages/grammar/reducer.tsx:13:64
   initialState: defaultState,
   reducers: {
     setList: (state) => state,
-    fetch: (state, { payload }: PayloadAction<GrammarList>) => {
-      return { ...state, list: payload };
-    },
+    fetch: (state, { payload }: PayloadAction<GrammarList>) => {},
     setLoading: (state, { payload }: PayloadAction<boolean>) => {
       return { ...state, loading: payload };

[Survived] BlockStatement
src/pages/grammar/reducer.tsx:16:65
     fetch: (state, { payload }: PayloadAction<GrammarList>) => {
       return { ...state, list: payload };
     },
-    setLoading: (state, { payload }: PayloadAction<boolean>) => {
-      return { ...state, loading: payload };
-    },
+    setLoading: (state, { payload }: PayloadAction<boolean>) => {},
   },
 });

[Survived] ObjectLiteral
src/pages/grammar/reducer.tsx:17:14
       return { ...state, list: payload };
     },
     setLoading: (state, { payload }: PayloadAction<boolean>) => {
-      return { ...state, loading: payload };
+      return {};
     },
   },
