[Survived] BlockStatement
src/pages/orphography/index.tsx:3:38
 import React from 'react';
 import Layout from "@pages/Layout";
-export default function orphography(){
-  return <Layout>
-    <h3>Орфография</h3>
-    </Layout>;
-}
+export default function orphography(){}
