[Survived] BlockStatement
modules/Admin/LeftMenu/LeftMenuPresenter.tsx:4:37
 import React, { FC } from "react";
 import { Ul, Menu, ListLink } from "@components/Elements/elements";
 
-const LeftMenuPresenter: FC = () => {
-  return (
-    <Menu>
-      <Ul>
-        <li>
-          <ListLink to="/admin/grammar">Грамматика</ListLink>
-        </li>
-        <li>
-          <ListLink to="/admin/orphography">Орфография</ListLink>
-        </li>
-      </Ul>
-    </Menu>
-  );
-};
+const LeftMenuPresenter: FC = () => {};
 
 export default LeftMenuPresenter;
