[Survived] ObjectLiteral
hw14/src/store/reducers.tsx:9:3
 import { getLoginModule } from "@auth/modules";
 
 export const store = createStore(
-  {
-    extensions: [getSagaExtension({})],
-  },
+  {},
   getLoginModule()
 );

[Survived] ObjectLiteral
hw14/src/store/reducers.tsx:15:40
   getLoginModule()
 );
 
-export const reducer = combineReducers({
-  grammarList: grammarListReducer,
-  auth: authReducer,
-});
+export const reducer = combineReducers({});
 
 export type reducerType = ReturnType<typeof reducer>;
