[Survived] BlockStatement
src/modules/Auth/AuthPage.tsx:16:49
   status: CheckState;
 }
 
-const mapStateToProps = (state: reducerType) => {
-  const { status } = state.auth;
-  return {
-    status,
-  };
-};
+const mapStateToProps = (state: reducerType) => {};
 
 const mapDispatchToProps = {

[Survived] ObjectLiteral
src/modules/Auth/AuthPage.tsx:28:11
 };
 
 export class AuthPage extends Component<AuthProps> {
-  state = {
-    user: "",
-    password: "",
-  };
+  state = {};
 
   submit = async (e: FormEvent) => {

[Survived] StringLiteral
src/modules/Auth/AuthPage.tsx:30:15
 export class AuthPage extends Component<AuthProps> {
   state = {
     user: "",
-    password: "",
+    password: "Stryker was here!",
   };
 

[Survived] BlockStatement
src/modules/Auth/AuthPage.tsx:33:36
     password: "",
   };
 
-  submit = async (e: FormEvent) => {
-    e.preventDefault();
-    const { auth } = this.props;
-    await auth({
-      user: this.state.user,
-      password: this.state.password,
-    });
-  };
+  submit = async (e: FormEvent) => {};
 
   render() {

[Survived] BlockStatement
src/modules/Auth/AuthPage.tsx:42:12
     });
   };
 
-  render() {
-    if (this.props.status === CheckState.succeed) {
-      return <Redirect to="/admin" />;
-    }
-    return (
-      <AuthPagePresenter
-        user={this.state.user}
-        password={this.state.password}
-        status={this.props.status}
-        changeUser={(ev: React.FormEvent) =>
-          this.setState({ user: (ev.target as HTMLInputElement).value })
-        }
-        changePassword={(ev: React.FormEvent) =>
-          this.setState({ password: (ev.target as HTMLInputElement).value })
-        }
-        submit={this.submit}
-      />
-    );
-  }
+  render() {}
 }
 

[Survived] EqualityOperator
src/modules/Auth/AuthPage.tsx:43:9
   };
 
   render() {
-    if (this.props.status === CheckState.succeed) {
+    if (this.props.status !== CheckState.succeed) {
       return <Redirect to="/admin" />;
     }

[Survived] ConditionalExpression
src/modules/Auth/AuthPage.tsx:43:9
   };
 
   render() {
-    if (this.props.status === CheckState.succeed) {
+    if (false) {
       return <Redirect to="/admin" />;
     }

[Survived] ArrowFunction
src/modules/Auth/AuthPage.tsx:51:21
         user={this.state.user}
         password={this.state.password}
         status={this.props.status}
-        changeUser={(ev: React.FormEvent) =>
-          this.setState({ user: (ev.target as HTMLInputElement).value })
+        changeUser={() => undefined
         }
         changePassword={(ev: React.FormEvent) =>

[Survived] ArrowFunction
src/modules/Auth/AuthPage.tsx:54:25
         changeUser={(ev: React.FormEvent) =>
           this.setState({ user: (ev.target as HTMLInputElement).value })
         }
-        changePassword={(ev: React.FormEvent) =>
-          this.setState({ password: (ev.target as HTMLInputElement).value })
+        changePassword={() => undefined
         }
         submit={this.submit}
