[Survived] ArrayDeclaration
src/modules/Auth/AuthPagePresenter.stories.tsx:8:15
 
 export default {
   title: "Auth",
-  decorators: [withKnobs],
+  decorators: [],
 };
 

[Survived] BlockStatement
src/modules/Auth/AuthPagePresenter.stories.tsx:11:23
   decorators: [withKnobs],
 };
 
-const submit = (e) => {
-  e.preventDefault();
-};
+const submit = (e) => {};
 
 export const Auth: React.FC = () => {

[Survived] BlockStatement
src/modules/Auth/AuthPagePresenter.stories.tsx:15:37
   e.preventDefault();
 };
 
-export const Auth: React.FC = () => {
-  const user = text("user", "");
-  const password = text("password", "");
-  return (
-    <AuthPagePresenter
-      user={user}
-      status={0}
-      password={password}
-      changeUser={action("user")}
-      changePassword={action("password")}
-      submit={submit}
-    />
-  );
-};
+export const Auth: React.FC = () => {};
 

[Survived] StringLiteral
src/modules/Auth/AuthPagePresenter.stories.tsx:17:25
 
 export const Auth: React.FC = () => {
   const user = text("user", "");
-  const password = text("password", "");
+  const password = text("", "");
   return (
     <AuthPagePresenter

[Survived] StringLiteral
src/modules/Auth/AuthPagePresenter.stories.tsx:17:37
 
 export const Auth: React.FC = () => {
   const user = text("user", "");
-  const password = text("password", "");
+  const password = text("password", "Stryker was here!");
   return (
     <AuthPagePresenter
