[Survived] ArrayDeclaration
hw14/src/store/store.tsx:11:9
 
 let store;
 const initialState = {
-  list: [],
+  list: ["Stryker was here"],
 };
 

[Survived] BlockStatement
hw14/src/store/store.tsx:14:51
   list: [],
 };
 
-function initStore(preloadedState = initialState) {
-  const sagaMiddleware = createSagaMiddleware();
-  const store = configureStore({
-    reducer,
-    middleware: [sagaMiddleware],
-  });
-
-  function* rootSaga() {
-    yield fork(grammarListSaga);
-  }
-  sagaMiddleware.run(rootSaga);
-  return store;
-}
+function initStore(preloadedState = initialState) {}
 
 export const initializeStore = (preloadedState) => {

[Survived] BlockStatement
hw14/src/store/store.tsx:21:24
     middleware: [sagaMiddleware],
   });
 
-  function* rootSaga() {
-    yield fork(grammarListSaga);
-  }
+  function* rootSaga() {}
   sagaMiddleware.run(rootSaga);
   return store;

[Survived] BlockStatement
hw14/src/store/store.tsx:28:52
   return store;
 }
 
-export const initializeStore = (preloadedState) => {
-  let _store = store ?? initStore(preloadedState);
-  if (preloadedState && store) {
-    _store = initStore({
-      ...store.getState(),
-      ...preloadedState,
-    });
-    store = undefined;
-  }
-  if (typeof window === "undefined") return _store;
-  if (!store) store = _store;
-  return _store;
-};
+export const initializeStore = (preloadedState) => {};
 
 export function useStore(initialState) {

[Survived] BlockStatement
hw14/src/store/store.tsx:30:32
 
 export const initializeStore = (preloadedState) => {
   let _store = store ?? initStore(preloadedState);
-  if (preloadedState && store) {
-    _store = initStore({
-      ...store.getState(),
-      ...preloadedState,
-    });
-    store = undefined;
-  }
+  if (preloadedState && store) {}
   if (typeof window === "undefined") return _store;
   if (!store) store = _store;

[Survived] LogicalOperator
hw14/src/store/store.tsx:30:7
 
 export const initializeStore = (preloadedState) => {
   let _store = store ?? initStore(preloadedState);
-  if (preloadedState && store) {
+  if (preloadedState || store) {
     _store = initStore({
       ...store.getState(),

[Survived] ConditionalExpression
hw14/src/store/store.tsx:37:7
     });
     store = undefined;
   }
-  if (typeof window === "undefined") return _store;
+  if (true) return _store;
   if (!store) store = _store;
   return _store;

[Survived] EqualityOperator
hw14/src/store/store.tsx:37:7
     });
     store = undefined;
   }
-  if (typeof window === "undefined") return _store;
+  if (typeof window !== "undefined") return _store;
   if (!store) store = _store;
   return _store;

[Survived] BooleanLiteral
hw14/src/store/store.tsx:38:7
     store = undefined;
   }
   if (typeof window === "undefined") return _store;
-  if (!store) store = _store;
+  if (store) store = _store;
   return _store;
 };

[Survived] ConditionalExpression
hw14/src/store/store.tsx:38:7
     store = undefined;
   }
   if (typeof window === "undefined") return _store;
-  if (!store) store = _store;
+  if (true) store = _store;
   return _store;
 };

[Survived] BlockStatement
hw14/src/store/store.tsx:42:40
   return _store;
 };
 
-export function useStore(initialState) {
-  const store = useMemo(() => initializeStore(initialState), [initialState]);
-  return store;
-}
+export function useStore(initialState) {}
 

[Survived] ArrowFunction
hw14/src/store/store.tsx:43:25
 };
 
 export function useStore(initialState) {
-  const store = useMemo(() => initializeStore(initialState), [initialState]);
+  const store = useMemo(() => undefined, [initialState]);
   return store;
 }

[Survived] ArrayDeclaration
hw14/src/store/store.tsx:43:62
 };
 
 export function useStore(initialState) {
-  const store = useMemo(() => initializeStore(initialState), [initialState]);
+  const store = useMemo(() => initializeStore(initialState), []);
   return store;
 }
