[Survived] BlockStatement
src/modules/Auth/AuthPagePresenter.tsx:45:17
           />
         </Label>
         <Button status={props.status}>Вход</Button>
-        {(() => {
-          if (props.status === CheckState.failed) {
-            return "Ошибка авторизации";
-          }
-          if (props.status === CheckState.zeroData) {
-            return "Пустые данные";
-          }
-        })()}
+        {(() => {})()}
       </form>
     </Page>

[Survived] EqualityOperator
src/modules/Auth/AuthPagePresenter.tsx:46:15
         </Label>
         <Button status={props.status}>Вход</Button>
         {(() => {
-          if (props.status === CheckState.failed) {
+          if (props.status !== CheckState.failed) {
             return "Ошибка авторизации";
           }

[Survived] ConditionalExpression
src/modules/Auth/AuthPagePresenter.tsx:46:15
         </Label>
         <Button status={props.status}>Вход</Button>
         {(() => {
-          if (props.status === CheckState.failed) {
+          if (false) {
             return "Ошибка авторизации";
           }

[Survived] BlockStatement
src/modules/Auth/AuthPagePresenter.tsx:49:53
           if (props.status === CheckState.failed) {
             return "Ошибка авторизации";
           }
-          if (props.status === CheckState.zeroData) {
-            return "Пустые данные";
-          }
+          if (props.status === CheckState.zeroData) {}
         })()}
       </form>

[Survived] EqualityOperator
src/modules/Auth/AuthPagePresenter.tsx:49:15
           if (props.status === CheckState.failed) {
             return "Ошибка авторизации";
           }
-          if (props.status === CheckState.zeroData) {
+          if (props.status !== CheckState.zeroData) {
             return "Пустые данные";
           }

[Survived] StringLiteral
src/modules/Auth/AuthPagePresenter.tsx:50:20
             return "Ошибка авторизации";
           }
           if (props.status === CheckState.zeroData) {
-            return "Пустые данные";
+            return "";
           }
         })()}
