[Survived] BlockStatement
src/modules/Auth/data.tsx:6:64
   user: "root",
   password: "root",
 };
-export const login = async (user: string, password: string) => {
-  await sleep(200);
-
-  return user == data.user && password == data.password;
-};
+export const login = async (user: string, password: string) => {};
 
 export const logout = async () => {

[Survived] EqualityOperator
src/modules/Auth/data.tsx:9:31
 export const login = async (user: string, password: string) => {
   await sleep(200);
 
-  return user == data.user && password == data.password;
+  return user == data.user && password != data.password;
 };
 

[Survived] EqualityOperator
src/modules/Auth/data.tsx:9:10
 export const login = async (user: string, password: string) => {
   await sleep(200);
 
-  return user == data.user && password == data.password;
+  return user != data.user && password == data.password;
 };
 

[Survived] BlockStatement
src/modules/Auth/data.tsx:12:35
   return user == data.user && password == data.password;
 };
 
-export const logout = async () => {
-  await sleep(200);
-  localStorage.removeItem("auth");
-};
+export const logout = async () => {};
 
 export const isAuthorised = async () => {

[Survived] BlockStatement
src/modules/Auth/data.tsx:17:41
   localStorage.removeItem("auth");
 };
 
-export const isAuthorised = async () => {
-  await sleep(200);
-  return localStorage.getItem("auth") === data.user;
-};
+export const isAuthorised = async () => {};
 

[Survived] ConditionalExpression
src/modules/Auth/data.tsx:19:10
 
 export const isAuthorised = async () => {
   await sleep(200);
-  return localStorage.getItem("auth") === data.user;
+  return false;
 };
 

[Survived] ConditionalExpression
src/modules/Auth/data.tsx:19:10
 
 export const isAuthorised = async () => {
   await sleep(200);
-  return localStorage.getItem("auth") === data.user;
+  return true;
 };
 
