[Survived] ArrowFunction
src/modules/Auth/modules.tsx:6:31
 import { reducer } from "./reducer";
 import { loginSaga } from "./saga";
 
-export const getLoginModule = (): ISagaModule<typeof reducer> => ({
-  id: "login",
-  reducerMap: {
-    login: reducer,
-  },
-  sagas: [loginSaga],
-});
+export const getLoginModule = () => undefined;
 export default getLoginModule;
 

[Survived] StringLiteral
src/modules/Auth/modules.tsx:7:7
 import { loginSaga } from "./saga";
 
 export const getLoginModule = (): ISagaModule<typeof reducer> => ({
-  id: "login",
+  id: "",
   reducerMap: {
     login: reducer,

[Survived] ObjectLiteral
src/modules/Auth/modules.tsx:8:15
 
 export const getLoginModule = (): ISagaModule<typeof reducer> => ({
   id: "login",
-  reducerMap: {
-    login: reducer,
-  },
+  reducerMap: {},
   sagas: [loginSaga],
 });

[Survived] ArrayDeclaration
src/modules/Auth/modules.tsx:11:10
   reducerMap: {
     login: reducer,
   },
-  sagas: [loginSaga],
+  sagas: [],
 });
 export default getLoginModule;
