[Killed] StringLiteral
src/modules/Auth/reducer.tsx:5:9
 import { Auth, Login, CheckState } from "./types";
 
 export const defaultState: Auth = {
-  user: "",
+  user: "Stryker was here!",
   status: CheckState.initiated,
 };

[Killed] BlockStatement
src/modules/Auth/reducer.tsx:12:63
   name: "auth",
   initialState: defaultState,
   reducers: {
-    auth: (state: Auth, { payload }: PayloadAction<Login>) => {
-      return { ...state, user: payload.user, status: CheckState.succeed };
-    },
+    auth: (state: Auth, { payload }: PayloadAction<Login>) => {},
     login: (state: Auth) => {
       return { ...state, status: CheckState.succeed };

[Killed] BlockStatement
src/modules/Auth/reducer.tsx:15:29
     auth: (state: Auth, { payload }: PayloadAction<Login>) => {
       return { ...state, user: payload.user, status: CheckState.succeed };
     },
-    login: (state: Auth) => {
-      return { ...state, status: CheckState.succeed };
-    },
+    login: (state: Auth) => {},
     logout: (state: Auth) => {
       return { ...state, status: CheckState.initiated };

[Killed] ObjectLiteral
src/modules/Auth/reducer.tsx:16:14
       return { ...state, user: payload.user, status: CheckState.succeed };
     },
     login: (state: Auth) => {
-      return { ...state, status: CheckState.succeed };
+      return {};
     },
     logout: (state: Auth) => {

[Survived] BlockStatement
src/modules/Auth/reducer.tsx:18:30
     login: (state: Auth) => {
       return { ...state, status: CheckState.succeed };
     },
-    logout: (state: Auth) => {
-      return { ...state, status: CheckState.initiated };
-    },
+    logout: (state: Auth) => {},
     loading: (state: Auth) => {
       return { ...state, status: CheckState.loading };

[Killed] ObjectLiteral
src/modules/Auth/reducer.tsx:19:14
       return { ...state, status: CheckState.succeed };
     },
     logout: (state: Auth) => {
-      return { ...state, status: CheckState.initiated };
+      return {};
     },
     loading: (state: Auth) => {

[Killed] BlockStatement
src/modules/Auth/reducer.tsx:21:31
     logout: (state: Auth) => {
       return { ...state, status: CheckState.initiated };
     },
-    loading: (state: Auth) => {
-      return { ...state, status: CheckState.loading };
-    },
+    loading: (state: Auth) => {},
     failed: (state: Auth) => {
       return { ...state, status: CheckState.failed };

[Killed] ObjectLiteral
src/modules/Auth/reducer.tsx:22:14
       return { ...state, status: CheckState.initiated };
     },
     loading: (state: Auth) => {
-      return { ...state, status: CheckState.loading };
+      return {};
     },
     failed: (state: Auth) => {

[Killed] BlockStatement
src/modules/Auth/reducer.tsx:24:30
     loading: (state: Auth) => {
       return { ...state, status: CheckState.loading };
     },
-    failed: (state: Auth) => {
-      return { ...state, status: CheckState.failed };
-    },
+    failed: (state: Auth) => {},
     zeroData: (state: Auth) => {
       return { ...state, status: CheckState.zeroData };

[Survived] BlockStatement
src/modules/Auth/reducer.tsx:27:32
     failed: (state: Auth) => {
       return { ...state, status: CheckState.failed };
     },
-    zeroData: (state: Auth) => {
-      return { ...state, status: CheckState.zeroData };
-    },
+    zeroData: (state: Auth) => {},
   },
 });
