[Killed] BlockStatement
src/modules/Auth/saga.tsx:11:37
 import { login as serverLogin } from "./data";
 import { actions } from "./reducer";
 
-export function* checkUserSession() {
-  const auth: boolean = yield call(isAuthorised);
-  if (auth) {
-    yield put(actions.login());
-  } else {
-    yield put(actions.logout());
-  }
-}
+export function* checkUserSession() {}
 
 export function* auth(data: ReturnType<typeof actions.auth>) {

[Killed] BlockStatement
src/modules/Auth/saga.tsx:13:13
 
 export function* checkUserSession() {
   const auth: boolean = yield call(isAuthorised);
-  if (auth) {
-    yield put(actions.login());
-  } else {
+  if (auth) {} else {
     yield put(actions.logout());
   }

[Killed] ConditionalExpression
src/modules/Auth/saga.tsx:13:7
 
 export function* checkUserSession() {
   const auth: boolean = yield call(isAuthorised);
-  if (auth) {
+  if (false) {
     yield put(actions.login());
   } else {

[Survived] BlockStatement
src/modules/Auth/saga.tsx:15:10
   const auth: boolean = yield call(isAuthorised);
   if (auth) {
     yield put(actions.login());
-  } else {
-    yield put(actions.logout());
-  }
+  } else {}
 }
 

[Killed] BlockStatement
src/modules/Auth/saga.tsx:20:62
   }
 }
 
-export function* auth(data: ReturnType<typeof actions.auth>) {
-  try {
-    yield put(actions.loading());
-    const { user, password } = data.payload;
-    if (user.trim() === "" || password.trim() === "") {
-      yield put(actions.zeroData());
-      return false;
-    }
-    const logined: boolean = yield call(serverLogin, user, password);
-    if (logined) {
-      yield all([call(sessionLogin, user), put(actions.login())]);
-    } else {
-      yield put(actions.failed());
-    }
-    return logined;
-  } catch (error) {
-    yield put(actions.logout());
-  }
-}
+export function* auth(data: ReturnType<typeof actions.auth>) {}
 export function* logout() {
   yield all([call(sessionLogout), put(actions.logout())]);

[Killed] BlockStatement
src/modules/Auth/saga.tsx:21:7
 }
 
 export function* auth(data: ReturnType<typeof actions.auth>) {
-  try {
-    yield put(actions.loading());
-    const { user, password } = data.payload;
-    if (user.trim() === "" || password.trim() === "") {
-      yield put(actions.zeroData());
-      return false;
-    }
-    const logined: boolean = yield call(serverLogin, user, password);
-    if (logined) {
-      yield all([call(sessionLogin, user), put(actions.login())]);
-    } else {
-      yield put(actions.failed());
-    }
-    return logined;
-  } catch (error) {
+  try {} catch (error) {
     yield put(actions.logout());
   }

[Killed] EqualityOperator
src/modules/Auth/saga.tsx:24:31
   try {
     yield put(actions.loading());
     const { user, password } = data.payload;
-    if (user.trim() === "" || password.trim() === "") {
+    if (user.trim() === "" || password.trim() !== "") {
       yield put(actions.zeroData());
       return false;

[Killed] ConditionalExpression
src/modules/Auth/saga.tsx:24:31
   try {
     yield put(actions.loading());
     const { user, password } = data.payload;
-    if (user.trim() === "" || password.trim() === "") {
+    if (user.trim() === "" || true) {
       yield put(actions.zeroData());
       return false;

[Survived] BooleanLiteral
src/modules/Auth/saga.tsx:26:14
     const { user, password } = data.payload;
     if (user.trim() === "" || password.trim() === "") {
       yield put(actions.zeroData());
-      return false;
+      return true;
     }
     const logined: boolean = yield call(serverLogin, user, password);

[Killed] ConditionalExpression
src/modules/Auth/saga.tsx:29:9
       return false;
     }
     const logined: boolean = yield call(serverLogin, user, password);
-    if (logined) {
+    if (false) {
       yield all([call(sessionLogin, user), put(actions.login())]);
     } else {

[Killed] BlockStatement
src/modules/Auth/saga.tsx:29:18
       return false;
     }
     const logined: boolean = yield call(serverLogin, user, password);
-    if (logined) {
-      yield all([call(sessionLogin, user), put(actions.login())]);
-    } else {
+    if (logined) {} else {
       yield put(actions.failed());
     }

[Killed] ArrayDeclaration
src/modules/Auth/saga.tsx:30:17
     }
     const logined: boolean = yield call(serverLogin, user, password);
     if (logined) {
-      yield all([call(sessionLogin, user), put(actions.login())]);
+      yield all([]);
     } else {
       yield put(actions.failed());

[Survived] BlockStatement
src/modules/Auth/saga.tsx:31:12
     const logined: boolean = yield call(serverLogin, user, password);
     if (logined) {
       yield all([call(sessionLogin, user), put(actions.login())]);
-    } else {
-      yield put(actions.failed());
-    }
+    } else {}
     return logined;
   } catch (error) {

[Survived] BlockStatement
src/modules/Auth/saga.tsx:35:19
       yield put(actions.failed());
     }
     return logined;
-  } catch (error) {
-    yield put(actions.logout());
-  }
+  } catch (error) {}
 }
 export function* logout() {

[Killed] BlockStatement
src/modules/Auth/saga.tsx:39:27
     yield put(actions.logout());
   }
 }
-export function* logout() {
-  yield all([call(sessionLogout), put(actions.logout())]);
-}
+export function* logout() {}
 
 export function* loginSaga() {

[Killed] ArrayDeclaration
src/modules/Auth/saga.tsx:40:13
   }
 }
 export function* logout() {
-  yield all([call(sessionLogout), put(actions.logout())]);
+  yield all([]);
 }
 

[Survived] BlockStatement
src/modules/Auth/saga.tsx:43:30
   yield all([call(sessionLogout), put(actions.logout())]);
 }
 
-export function* loginSaga() {
-  yield fork(checkUserSession);
-  let logined, ath;
-  while (true) {
-    ath = yield take(actions.auth.type);
-    logined = yield* auth(ath);
-    if (logined) {
-      yield take(actions.logout.type);
-      yield* logout();
-    }
-  }
-}
+export function* loginSaga() {}
 

[Survived] ConditionalExpression
src/modules/Auth/saga.tsx:46:10
 export function* loginSaga() {
   yield fork(checkUserSession);
   let logined, ath;
-  while (true) {
+  while (false) {
     ath = yield take(actions.auth.type);
     logined = yield* auth(ath);

[Survived] ConditionalExpression
src/modules/Auth/saga.tsx:49:9
   while (true) {
     ath = yield take(actions.auth.type);
     logined = yield* auth(ath);
-    if (logined) {
+    if (true) {
       yield take(actions.logout.type);
       yield* logout();

[Survived] BlockStatement
src/modules/Auth/saga.tsx:49:18
   while (true) {
     ath = yield take(actions.auth.type);
     logined = yield* auth(ath);
-    if (logined) {
-      yield take(actions.logout.type);
-      yield* logout();
-    }
+    if (logined) {}
   }
 }
