[Survived] BlockStatement
src/modules/Auth/session.tsx:4:46
 import { sleep } from "@/functions";
 import { data } from "./data";
 
-export const login = async (user: string) => {
-  await sleep(200);
-  localStorage.setItem("auth", user);
-};
+export const login = async (user: string) => {};
 export const logout = async () => {
   await sleep(200);

[Survived] BlockStatement
src/modules/Auth/session.tsx:8:35
   await sleep(200);
   localStorage.setItem("auth", user);
 };
-export const logout = async () => {
-  await sleep(200);
-  localStorage.removeItem("auth");
-};
+export const logout = async () => {};
 export const isAuthorised = async () => {
   await sleep(200);

[Survived] StringLiteral
src/modules/Auth/session.tsx:10:27
 };
 export const logout = async () => {
   await sleep(200);
-  localStorage.removeItem("auth");
+  localStorage.removeItem("");
 };
 export const isAuthorised = async () => {

[Survived] BlockStatement
src/modules/Auth/session.tsx:12:41
   await sleep(200);
   localStorage.removeItem("auth");
 };
-export const isAuthorised = async () => {
-  await sleep(200);
-  return localStorage.getItem("auth") === data.user;
-};
+export const isAuthorised = async () => {};
 
